<h2>Comandos Iniciais</h2>

<h3>Importação do Pandas e dos Datasets</h3>

In [1]:
import pandas as pd

In [2]:
titanicTest = pd.read_csv('\databases-python\Etest.csv')

In [3]:
titanicTrain = pd.read_csv('\databases-python\Etrain.csv')

<h3>Training Set</h3>
<br>
<i>The training set should be used to build your machine learning models. For the training set, we provide the outcome (also known as the “ground truth”) for each passenger. Your model will be based on “features” like passengers’ gender and class. You can also use feature engineering to create new features.</i>

In [16]:
titanicTrain.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [10]:
titanicTrain.loc[0:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [10]:
titanicTrain.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

<h3>Test Set</h3>
<br>
<i>The test set should be used to see how well your model performs on unseen data. For the test set, we do not provide the ground truth for each passenger. It is your job to predict these outcomes. For each passenger in the test set, use the model you trained to predict whether or not they survived the sinking of the Titanic.</i>

In [12]:
titanicTest.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [11]:
titanicTest.loc[0:5]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S

In [12]:
titanicTest.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

<h3>Data Dictionary</h3>

| Variable | Definition | Key |
| :- | -:- | :-: |
| survival | Survival | 0 = No, 1 = Yes
| pclass | Ticket class | 1 = 1st, 2 = 2nd, 3 = 3rd
| sex | Sex | 
| Age | Age in years | 
| sibsp | # of siblings / spouses aboard the Titanic |
| parch | # of parents / children aboard the Titanic |
| ticket | Ticket number |
| fare | Passenger fare |
| cabin | Cabin number |
| embarked | Port of Embarkation | C = Cherbourg, Q = Queenstown, S = Southampton

<h3>Variable Notes</h3>
<br>
<b>pclass:</b> <i>A proxy for socio-economic status (SES)</i>
<br>
<i>1st = Upper</i>
<br>
<i>2nd = Middle</i>
<br>
<i>3rd = Lower</i>

<b>age:</b> <i>Age is fractional if less than 1. If the age is estimated, is it in the form of xx.5</i>

<i>sibsp: The dataset defines family relations in this way...</i>
<br>
<i>Sibling = brother, sister, stepbrother, stepsister</i>
<br>
<i>Spouse = husband, wife (mistresses and fiancés were ignored)</i>

<b>parch:</b> The dataset defines family relations in this way...
<br>
<i>Parent = mother, father</i>
<br>
<i>Child = daughter, son, stepdaughter, stepson</i>
<br>
<i>Some children travelled only with a nanny, therefore parch=0 for them.</i>

<h2>Manipulação de Dados com Pandas</h2>

<b>Quantidade Total de passageiros:</b>

In [12]:
titanicTrain['PassengerId'].max()

891

<b>Quantidade de passageiros distribuídos por Sexo:</b>

In [17]:
titanicTrain['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

<b>Idade do passageiro mais novo:</b>

In [19]:
titanicTrain['Age'].min()

0.42

<b>Idade do passageiro mais velho:</b>

In [31]:
titanicTrain['Age'].max()

80.0

<b>Quantidade de relação de parentesco pais/filhos a bordo:</b>

In [34]:
titanicTrain['Parch'].value_counts()

0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: Parch, dtype: int64

<b>Quantidade de relação de parentesco irmão/conjuge a bordo:</b>

In [40]:
titanicTrain['SibSp'].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

<b>Exemplo de campo de Idade não preenchido.</b>

In [42]:
titanicTrain[titanicTrain['Name']=='Nenkoff, Mr. Christo']['Age']

223   NaN
Name: Age, dtype: float64

In [5]:
titanicTrain[titanicTrain['Age']=='NaN']

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

<b>Quantidade de Linhas após dropar linhas faltantes.</b>

In [ ]:
titanicTrain2 = titanicTrain.dropna()

In [14]:
titanicTrain2.shape

(183, 12)

In [17]:
titanicTrain.shape

(891, 12)

<b>Tratamento de dados faltantes por variável.</b>

In [27]:
faltantes = titanicTrain.isnull().sum()
faltantes

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [30]:
titanicTrain['Age'].fillna(0, inplace=True) #também pode trocar por .mean()
titanicTrain['Cabin'].fillna('None', inplace=True)

<h2>Análise Exploratória de Dados</h2>

<h2>Pré-processamento e Selecão de Variáveis</h2>

<h3>Adequação/Formatação dos dados; Tratamento dos dados faltantes; tratamento de outliers; Seleção/Exclusão de variáveis; Redução de diensionalidade</h3>

<h2>Modelo de Machine Learning</h2>

<h2>Medição de Resultados</h2>